demo-output/website/dafoam/work_refined/NACA0012_Airfoil_Incompressible_refined/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    symmetry1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          14720;
        startFace       29210;
    }
    symmetry2
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          14720;
        startFace       43930;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          230;
        startFace       58650;
    }
    inout
    {
        type            patch;
        nFaces          230;
        startFace       58880;
    }
)

// ************************************************************************* //
